# vim:ft=ruby

tap "aelesbao/tools"
tap "bufbuild/buf"
tap "hashicorp/tap"
# tap "homebrew/bundle"
# tap "homebrew/cask"
# tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"


# Run your GitHub Actions locally 🚀
brew "act"
# Next-generation aircrack with lots of new features
brew "aircrack-ng"
# Record and share terminal sessions
brew "asciinema"
# Light UNIX download accelerator
brew "axel"
# Terminal bandwidth utilization tool
brew "bandwhich"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Compiler infrastructure and toolchain library for WebAssembly
brew "binaryen"
# Linux/OSX/FreeBSD resource monitor
brew "btop"
# A new way of working with Protocol Buffers.
brew "bufbuild/buf/buf"
# Mozilla CA certificate store
brew "ca-certificates"
# Hacker News in your terminal
brew "circumflex"
# Cross-platform make
brew "cmake"
# Color-highlighted diff(1) output
brew "colordiff"
# GNU File, Shell, and Text utilities
brew "coreutils"
# SQL-like query language for csv
brew "csvq"
# Reimplementation of ctags(1)
brew "ctags"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"
# JSON, YAML, TOML, XML, and CSV query and modification tool
brew "dasel"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Load/unload environment variables based on $PWD
brew "direnv"
# Pack, ship and run any application as a lightweight container
brew "docker"
brew "docker-buildx"
brew "docker-completion"
brew "docker-compose"
brew "docker-credential-helper"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# More intuitive version of du in rust
brew "dust"
# eza is a modern, maintained replacement for ls, built on exa.
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Monitor a directory for changes and run a shell command
brew "fswatch"

# Command-line fuzzy finder written in Go
brew "fzf"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# GNU compiler collection
brew "gcc"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Quickly rewrite git repository history (filter-branch replacement)
brew "git-filter-repo"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Small git utilities
brew "git-extras"
# Git extension for versioning large files
brew "git-lfs"
# Core application library for C
brew "glib"
# Render markdown on the CLI
brew "glow"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Fast linters runner for Go
brew "golangci-lint"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Go version management
brew "goenv"
# Version Control Visualization Tool
brew "gource"
# Generic Log Colourizer
brew "grc"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# GNU grep, egrep and fgrep
brew "grep"
# Like cURL, but for gRPC
brew "grpcurl"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# Tool for glamorous shell scripts
brew "gum"
# Smarter Dockerfile linter to validate best practices
brew "hadolint"
# OpenType text shaping engine
brew "harfbuzz"
# Kubernetes package manager
brew "helm"
# Command-line utility for Home Assistant
brew "homeassistant-cli"
# Improved top (interactive process viewer)
brew "htop"
# Add GitHub support to git on the command-line
brew "hub"
# Command-line benchmarking tool
brew "hyperfine"
# Build, launch, and maintain any crypto application with Ignite CLI
brew "ignite"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Peer-to-peer hypermedia protocol
brew "ipfs"
# Manage your Java environment
brew "jenv"
# Handy way to save and run project-specific commands
brew "just"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Package manager for kubectl plugins
brew "krew"
# The lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# C virtualization API
brew "libvirt"
# Next-gen compiler infrastructure
brew "lld"
brew "llvm"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Mac App Store command-line interface
brew "mas"
# Java-based project management
brew "maven"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# No Nonsense Neovim Client in Rust
brew "neovide"
# CLI for NextDNS's DNS-over-HTTPS (DoH)
# brew "nextdns"
# Platform built on V8 to build network applications
brew "node"
# Manage multiple Node.js versions
brew "nvm"
# Development kit for the Java programming language
brew "openjdk"
# Reattach to the user's GUI session on macOS during authentication (for Touch ID support in tmux)
brew "pam-reattach"
# Highly capable, feature-rich programming language
brew "perl"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Manage compile and link flags for libraries
brew "pkg-config"
# Modern replacement for ps written by Rust
brew "procs"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Python version management
brew "pyenv"
# Generic machine emulator and virtualizer
brew "qemu"
# Ruby version manager
brew "rbenv"
# Rsync for cloud storage
brew "rclone"
# A faster grep
brew "ripgrep"
# Utility that provides fast incremental file transfer
brew "rsync"
# Install various Ruby versions and implementations
brew "ruby-build"
# Experimental Rust compiler front-end for IDEs
brew "rust-analyzer"
# Rust toolchain installer
brew "rustup"
# Build tool for Scala projects
brew "sbt"
# JVM-based programming language
brew "scala"
# Used as a compiler wrapper and avoids compilation when possible
brew "sccache"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Fuzzy finder in rust
brew "sk"
# Automate your tmux workflow
brew "smug"
# Contract-oriented programming language
brew "solidity"
# Editor of encrypted files
brew "sops"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Cross-shell prompt for astronauts
brew "starship"
# Version control system designed to be a better CVS
brew "subversion"
# Next-generation smart contract platform powered by the Move programming language
brew "sui"
# User interface to the TELNET protocol
brew "telnet"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Tool to build, change, and version infrastructure
brew "hashicorp/tap/terraform"
# Linter for Terraform files
brew "tflint"
# Static analysis security scanner for your terraform code
brew "tfsec"
# Text interface for Git repositories
brew "tig"
# Terminal multiplexer
brew "tmux"
# Color-based alternative to figlet (uses libcaca)
brew "toilet"
# Parser generator tool and incremental parsing library
brew "tree-sitter"
# Anonymizing overlay network for TCP
brew "tor"
# CLI tool that moves files or folder to the trash
brew "trash"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Development environment, testing framework and asset pipeline for Ethereum
brew "truffle"
# Validating, recursive, caching DNS resolver
brew "unbound"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Your CLI home video recorder
brew "vhs"
# Generator for LS_COLORS with support for multiple color themes
brew "vivid"
# The WebAssembly Binary Toolkit
brew "wabt"
# 🚀 The Universal WebAssembly Runtime
brew "wasmer"
# Internet file retriever
brew "wget"
# Friendly and fast tool for sending HTTP requests
brew "xh"
# Yet Another Dotfiles Manager
brew "yadm"
# JavaScript package manager
brew "yarn"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Process YAML documents from the CLI
brew "yq"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"

# Execute git operations in multiple repositories
brew "aelesbao/tools/git-recursive"

# A tiling window manager for macOS based on binary space partitioning
brew "koekeishiya/formulae/skhd"
# Simple hotkey-daemon for macOS
brew "koekeishiya/formulae/yabai"
# Keyboard customizer
cask "karabiner-elements"

# Password manager that keeps all passwords secure behind one password
cask "1password", args: { appdir: "/Applications" }
# Command-line helper for the 1Password password manager
cask "1password-cli", args: { appdir: "/Applications" }
# View, print, and comment on PDF documents
cask "adobe-acrobat-reader", args: { appdir: "/Applications" }
# A cross-platform, OpenGL terminal emulator
cask "alacritty"
## Command-line tools for building and debugging Android apps
#cask "android-commandlinetools"
## Android SDK component
#cask "android-platform-tools"
# Application uninstaller
cask "appcleaner", args: { appdir: "/Applications" }
# Chromium based browser
cask "arc", args: { appdir: "/Applications" }
# Two-way text copying
cask "balenaetcher", args: { appdir: "/Applications" }
# Menu bar icon organizer
cask "bartender", args: { appdir: "/Applications" }
# Web browser focusing on privacy
cask "brave-browser"
# Official internet speed test from the German Bundesnetzagentur
# cask "breitbandmessung"
# Utility that prevents the system from going to sleep
cask "caffeine", args: { appdir: "/Applications" }
# OpenAI's official ChatGPT desktop app
# cask "chatgpt" # Not available for Intel processors
# Semantic code analysis engine
cask "codeql"
# Write, edit, and chat about your code with AI
cask "cursor"
# Disk space visualizer
cask "daisydisk", args: { appdir: "/Applications" }
# Trains AIs to understand and translate texts
cask "deepl", args: { appdir: "/Applications" }
# Voice and text chat software
cask "discord"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Matrix collaboration client
cask "element"
# Network scanner
cask "fing"
# Web browser
cask "firefox"
# Game client
cask "gog-galaxy"
# Web browser
cask "google-chrome"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "google-cloud-sdk", args: { appdir: "/Applications" }
# Tools to protect your emails and files
cask "gpg-suite", args: { appdir: "/Applications" }
# GraalVM from Oracle
cask "graalvm-jdk"
# Grammarly for desktop
cask "grammarly-desktop", args: { appdir: "/Applications" }
# Companion app for Home Assistant home automation software
cask "home-assistant"
# HTTP and GraphQL Client
cask "insomnia", args: { appdir: "/Applications" }
# Menu bar application for the IPFS peer-to-peer network
cask "ipfs"
# System monitoring app
cask "istat-menus", args: { appdir: "/Applications" }
# JetBrains tools manager
cask "jetbrains-toolbox", args: { appdir: "/Applications" }
# Display key code, unicode value and modifier keys state for any key combination
cask "key-codes"
# End-to-end encryption software
cask "keybase"
# GPU-based terminal emulator
cask "kitty"
# Wallet desktop application to maintain multiple cryptocurrencies
cask "ledger-live"
# Free cross-platform office suite, fresh version
cask "libreoffice", args: { appdir: "/Applications" }
# Open-source Markdown editor
cask "macdown", args: { appdir: "/Applications" }
# Native desktop app for Messenger (formerly Facebook Messenger)
cask "messenger"
# Native app email client for Gmail
cask "mimestream"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# VPN client for secure internet access and private browsing
cask "nordvpn", args: { appdir: "/Applications" }
# App to write, plan, collaborate, and get organized
cask "notion", args: { appdir: "/Applications" }
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Xbox streaming client
cask "onecast"
# GUI client for PostgreSQL databases
cask "postico"
# Collaboration platform for API development
cask "postman"
# Client for Proton Mail and Proton Calendar
cask "proton-mail"
# NAS management application
cask "qfinder-pro"
# QNAP Sync utility
# cask "qsync-client"
# Imaging utility to install operating systems to a microSD card
cask "raspberry-pi-imager"
# Control your tools with a few keystrokes
cask "raycast"
# Instant messaging application focusing on security
cask "signal"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify", args: { appdir: "/Applications" }
# Video game digital distribution service
cask "steam"
# Messaging app with a focus on speed and security
cask "telegram"
# Unpacks archive files
cask "the-unarchiver", args: { appdir: "/Applications" }
# File synchronization and sharing software
cask "resilio-sync"
# Development environment
cask "vagrant", args: { appdir: "/Applications" }
cask "vagrant-manager", args: { appdir: "/Applications" }
# Gives Vagrant VMware plugin access to various VMware functionalities
cask "vagrant-vmware-utility"
# Virtualizer for x86 hardware
cask "virtualbox"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Create, manage, and run virtual machines
cask "vmware-fusion"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
# Desktop client for WhatsApp
cask "whatsapp", args: { appdir: "/Applications" }
# Multiplayer code editor
cask "zed"
# Video communication and virtual meeting platform
cask "zoom"

# Fonts
cask "font-cascadia-code"
cask "font-caskaydia-cove-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-fira-code"
cask "font-hack"
cask "font-hack-nerd-font"
cask "font-inconsolata"
cask "font-inconsolata-nerd-font"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-montserrat"
cask "font-roboto-mono"
cask "font-roboto-mono-nerd-font"
cask "font-ubuntu"
cask "font-ubuntu-mono"
cask "font-ubuntu-mono-nerd-font"
cask "font-ubuntu-nerd-font"
# San Francisco symbols font with Apple glyphs
cask "sf-symbols"

mas "1Password for Safari", id: 1569813296
mas "Boop", id: 1518425043
mas "Codye", id: 1516894961
mas "HP Smart", id: 1474276998
mas "Harvest", id: 506189836
mas "LilyView", id: 529490330
mas "Microsoft Word", id: 462054704
mas "NextDNS", id: 1464122853
mas "Numbers", id: 409203825
mas "Outbank", id: 1094255754
mas "Pages", id: 409201541
mas "Paste", id: 967805235
mas "Pixelmator Pro", id: 1289583905
mas "PopClip", id: 445189367
mas "ScreenBrush", id: 1233965871
mas "Todoist", id: 585829637
mas "Unclutter", id: 577085396
mas "WireGuard", id: 1451685025
